{
  "architectures": [
    "SimpleLLMForCasualLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_simplellm.SimpleLLMConfig",
    "AutoModel": "modeling_simplellm.SimpleLLMModel",
    "AutoModelForCausalLM": "modeling_simplellm.SimpleLLMForCasualLM"
  },
  "hidden_act": "relu",
  "hidden_size": 8,
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "model_type": "simplellm",
  "num_hidden_layers": 2,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.3",
  "vocab_size": 8
}

